InformationRegisters/ЦветаЭтаповРаботыСКандидатами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦветаЭтаповРаботыСКандидатами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭтапРаботы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЭтапРаботыСКандидатами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦветаЭтаповРаботыСКандидатами/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляНезависимогоРегистра(Настройки, "ЭтапРаботы",
		"ПодборПерсонала");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает цвета этапов работы с кандидатами.
// 
// Параметры:
//  ЭтапРаботы - СправочникСсылка.ЭтапыРаботыСКандидатами, ПеречислениеСсылка.ЭтапыРаботыСКандидатами - Этап работы с кандидатом.
// 
// Возвращаемое значение:
//  Структура, ТаблицаЗначений - Структура с ключами или таблица значений с колонками "ЦветТекста" и "ЦветФона" в зависимости от типа параметра ЭтапРаботы.
Функция ЦветаЭтаповРаботыСКандидатами(ЭтапРаботы = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ЦветаЭтаповРаботыСКандидатами.ЦветТекста,
		|	ЦветаЭтаповРаботыСКандидатами.ЦветФона,
		|	ЦветаЭтаповРаботыСКандидатами.ЭтапРаботы КАК Этап
		|ИЗ
		|	РегистрСведений.ЦветаЭтаповРаботыСКандидатами КАК ЦветаЭтаповРаботыСКандидатами
		|ГДЕ
		|	&Условие";
	
	Если ОпределенТипЭтапа(ЭтапРаботы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ЦветаЭтаповРаботыСКандидатами.ЭтапРаботы = &Условие");
		Запрос.УстановитьПараметр("Условие", ЭтапРаботы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Условие", "ИСТИНА");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если ОпределенТипЭтапа(ЭтапРаботы) Тогда
		Результат = Новый Структура("ЦветТекста, ЦветФона");
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Вставить("ЦветТекста", Выборка.ЦветТекста.Получить());
			Результат.Вставить("ЦветФона", Выборка.ЦветФона.Получить());
		Иначе
			Результат.Вставить("ЦветТекста", WebЦвета.Черный);
			Результат.Вставить("ЦветФона", WebЦвета.Белый);
		КонецЕсли;
	Иначе
		Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ОпределенТипЭтапа(ЭтапРаботы)
	
	МассивТипов = Новый Массив();
	МассивТипов.Добавить(Тип("СправочникСсылка.ЭтапыРаботыСКандидатами"));
	МассивТипов.Добавить(Тип("ПеречислениеСсылка.ЭтапыРаботыСКандидатами"));
	
	Возврат МассивТипов.Найти(ТипЗнч(ЭтапРаботы)) <> Неопределено
	
КонецФункции

Процедура ЗаписатьЦвета(ЭтапРаботы, ЦветТекста, ЦветФона) Экспорт
	
	ХранилищеЦветаТекста = Новый ХранилищеЗначения(ЦветТекста);
	ХранилищеЦветаФона = Новый ХранилищеЗначения(ЦветФона);
	
	Попытка
		НоваяЗапись = СоздатьМенеджерЗаписи();
		НоваяЗапись.ЭтапРаботы = ЭтапРаботы;
		НоваяЗапись.ЦветТекста = ХранилищеЦветаТекста;
		НоваяЗапись.ЦветФона = ХранилищеЦветаФона;
		НоваяЗапись.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),
		УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстСообщения = НСтр("ru = 'Не удалось записать цвета этапа!'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
